<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="utf-8">
    <title>JSDoc: Source: js/genHtml.js</title>

    <script src="scripts/prettify/prettify.js"> </script>
    <script src="scripts/prettify/lang-css.js"> </script>
    <!--[if lt IE 9]>
      <script src="//html5shiv.googlecode.com/svn/trunk/html5.js"></script>
    <![endif]-->
    <link type="text/css" rel="stylesheet" href="styles/prettify-tomorrow.css">
    <link type="text/css" rel="stylesheet" href="styles/jsdoc-default.css">
</head>

<body>

<div id="main">

    <h1 class="page-title">Source: js/genHtml.js</h1>

    



    
    <section>
        <article>
            <pre class="prettyprint source linenums"><code>/**
 * Generates the HTML content for the legal information (Impressum).
 * @returns {string} The HTML content for the legal information (Impressum).
 */
function genLegal() {
    let html = "";
    html += `&lt;div class='impressum'>&lt;h1>Impressum&lt;/h1>&lt;p>Angaben gemäß § 5 TMG&lt;/p>&lt;p>Max Muster &lt;br> 
    Musterweg&lt;br> 
    12345 Musterstadt &lt;br> 
    &lt;/p>&lt;p> &lt;strong>Vertreten durch: &lt;/strong>&lt;br>
    Max Muster&lt;br>
    &lt;/p>&lt;p>&lt;strong>Kontakt:&lt;/strong> &lt;br>
    Telefon: 01234-789456&lt;br>
    Fax: 1234-56789&lt;br>
    E-Mail: &lt;a href='mailto:max@muster.de'>max@muster.de&lt;/a>&lt;/br>&lt;/p>&lt;p>&lt;strong>Umsatzsteuer-ID: &lt;/strong> &lt;br>
    Umsatzsteuer-Identifikationsnummer gemäß §27a Umsatzsteuergesetz: Musterustid.&lt;br>&lt;br>
    &lt;strong>Wirtschafts-ID: &lt;/strong>&lt;br>
    Musterwirtschaftsid&lt;br>
    &lt;/p>&lt;p>&lt;strong>Aufsichtsbehörde:&lt;/strong>&lt;br>
    Musteraufsicht Musterstadt&lt;br>&lt;/p>&lt;p>&lt;strong>Haftungsausschluss: &lt;/strong>&lt;br>&lt;br>&lt;strong>Haftung für Inhalte&lt;/strong>&lt;br>&lt;br>
    Die Inhalte unserer Seiten wurden mit größter Sorgfalt erstellt. Für die Richtigkeit, Vollständigkeit und Aktualität der Inhalte können wir jedoch keine Gewähr übernehmen. Als Diensteanbieter sind wir gemäß § 7 Abs.1 TMG für eigene Inhalte auf diesen Seiten nach den allgemeinen Gesetzen verantwortlich. Nach §§ 8 bis 10 TMG sind wir als Diensteanbieter jedoch nicht verpflichtet, übermittelte oder gespeicherte fremde Informationen zu überwachen oder nach Umständen zu forschen, die auf eine rechtswidrige Tätigkeit hinweisen. Verpflichtungen zur Entfernung oder Sperrung der Nutzung von Informationen nach den allgemeinen Gesetzen bleiben hiervon unberührt. Eine diesbezügliche Haftung ist jedoch erst ab dem Zeitpunkt der Kenntnis einer konkreten Rechtsverletzung möglich. Bei Bekanntwerden von entsprechenden Rechtsverletzungen werden wir diese Inhalte umgehend entfernen.&lt;br>&lt;br>&lt;strong>Urheberrecht&lt;/strong>&lt;br>&lt;br>
    Die durch die Seitenbetreiber erstellten Inhalte und Werke auf diesen Seiten unterliegen dem deutschen Urheberrecht. Die Vervielfältigung, Bearbeitung, Verbreitung und jede Art der Verwertung außerhalb der Grenzen des Urheberrechtes bedürfen der schriftlichen Zustimmung des jeweiligen Autors bzw. Erstellers. Downloads und Kopien dieser Seite sind nur für den privaten, nicht kommerziellen Gebrauch gestattet. Soweit die Inhalte auf dieser Seite nicht vom Betreiber erstellt wurden, werden die Urheberrechte Dritter beachtet. Insbesondere werden Inhalte Dritter als solche gekennzeichnet. Sollten Sie trotzdem auf eine Urheberrechtsverletzung aufmerksam werden, bitten wir um einen entsprechenden Hinweis. Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Inhalte umgehend entfernen.&lt;br>&lt;br>&lt;strong>Datenschutz&lt;/strong>&lt;br>&lt;br>
    Die Nutzung unserer Webseite ist in der Regel ohne Angabe personenbezogener Daten möglich. Soweit auf unseren Seiten personenbezogene Daten (beispielsweise Name, Anschrift oder eMail-Adressen) erhoben werden, erfolgt dies, soweit möglich, stets auf freiwilliger Basis. Diese Daten werden ohne Ihre ausdrückliche Zustimmung nicht an Dritte weitergegeben. &lt;br>
    Wir weisen darauf hin, dass die Datenübertragung im Internet (z.B. bei der Kommunikation per E-Mail) Sicherheitslücken aufweisen kann. Ein lückenloser Schutz der Daten vor dem Zugriff durch Dritte ist nicht möglich. &lt;br>
    Der Nutzung von im Rahmen der Impressumspflicht veröffentlichten Kontaktdaten durch Dritte zur Übersendung von nicht ausdrücklich angeforderter Werbung und Informationsmaterialien wird hiermit ausdrücklich widersprochen. Die Betreiber der Seiten behalten sich ausdrücklich rechtliche Schritte im Falle der unverlangten Zusendung von Werbeinformationen, etwa durch Spam-Mails, vor.&lt;br>
    &lt;/p>&lt;br> 
    Website Impressum erstellt durch &lt;a href="https://www.impressum-generator.de">impressum-generator.de&lt;/a> von der &lt;a href="https://www.kanzlei-hasselbach.de/" rel="nofollow">Kanzlei Hasselbach&lt;/a>
     &lt;/div>
     `;
    return html;
}

/**
 * Generates the HTML content for the privacy policy (Datenschutzerklärung).
 * @returns {string} The HTML content for the privacy policy (Datenschutzerklärung).
 */

function genPrivacy() {
    let html = "";
    html += `
        &lt;section class="law">
            &lt;h1>Datenschutz&amp;shy;erkl&amp;auml;rung&lt;/h1>
            &lt;h2>1. Datenschutz auf einen Blick&lt;/h2>
            &lt;h3>Allgemeine Hinweise&lt;/h3>
            &lt;p>Die folgenden Hinweise geben einen einfachen &amp;Uuml;berblick dar&amp;uuml;ber, was mit Ihren
                personenbezogenen
                Daten
                passiert, wenn Sie diese Website besuchen. Personenbezogene Daten sind alle Daten, mit denen Sie
                pers&amp;ouml;nlich
                identifiziert werden k&amp;ouml;nnen. Ausf&amp;uuml;hrliche Informationen zum Thema Datenschutz entnehmen
                Sie
                unserer
                unter
                diesem Text aufgef&amp;uuml;hrten Datenschutzerkl&amp;auml;rung.&lt;/p>
            &lt;h3>Datenerfassung auf dieser Website&lt;/h3>
            &lt;h4>Wer ist verantwortlich f&amp;uuml;r die Datenerfassung auf dieser Website?&lt;/h4>
            &lt;p>Die Datenverarbeitung auf dieser Website erfolgt durch den Websitebetreiber. Dessen Kontaktdaten
                k&amp;ouml;nnen
                Sie
                dem
                Abschnitt &amp;bdquo;Hinweis zur Verantwortlichen Stelle&amp;ldquo; in dieser Datenschutzerkl&amp;auml;rung
                entnehmen.
            &lt;/p>
            &lt;h4>Wie erfassen wir Ihre Daten?&lt;/h4>
            &lt;p>Ihre Daten werden zum einen dadurch erhoben, dass Sie uns diese mitteilen. Hierbei kann es sich
                z.&amp;nbsp;B. um
                Daten
                handeln, die Sie in ein Kontaktformular eingeben.&lt;/p>
            &lt;p>Andere Daten werden automatisch oder nach Ihrer Einwilligung beim Besuch der Website durch unsere
                IT-Systeme
                erfasst.
                Das sind vor allem technische Daten (z.&amp;nbsp;B. Internetbrowser, Betriebssystem oder Uhrzeit des
                Seitenaufrufs).
                Die
                Erfassung dieser Daten erfolgt automatisch, sobald Sie diese Website betreten.&lt;/p>
            &lt;h4>Wof&amp;uuml;r nutzen wir Ihre Daten?&lt;/h4>
            &lt;p>Ein Teil der Daten wird erhoben, um eine fehlerfreie Bereitstellung der Website zu
                gew&amp;auml;hrleisten. Andere
                Daten
                k&amp;ouml;nnen zur Analyse Ihres Nutzerverhaltens verwendet werden.&lt;/p>
            &lt;h4>Welche Rechte haben Sie bez&amp;uuml;glich Ihrer Daten?&lt;/h4>
            &lt;p>Sie haben jederzeit das Recht, unentgeltlich Auskunft &amp;uuml;ber Herkunft, Empf&amp;auml;nger und Zweck
                Ihrer
                gespeicherten personenbezogenen Daten zu erhalten. Sie haben au&amp;szlig;erdem ein Recht, die
                Berichtigung oder
                L&amp;ouml;schung dieser Daten zu verlangen. Wenn Sie eine Einwilligung zur Datenverarbeitung erteilt
                haben,
                k&amp;ouml;nnen
                Sie diese Einwilligung jederzeit f&amp;uuml;r die Zukunft widerrufen. Au&amp;szlig;erdem haben Sie das
                Recht, unter
                bestimmten Umst&amp;auml;nden die Einschr&amp;auml;nkung der Verarbeitung Ihrer personenbezogenen Daten zu
                verlangen.
                Des
                Weiteren steht Ihnen ein Beschwerderecht bei der zust&amp;auml;ndigen Aufsichtsbeh&amp;ouml;rde zu.&lt;/p>
            &lt;p>Hierzu sowie zu weiteren Fragen zum Thema Datenschutz k&amp;ouml;nnen Sie sich jederzeit an uns wenden.
            &lt;/p>
            &lt;h3>Analyse-Tools und Tools von Dritt&amp;shy;anbietern&lt;/h3>
            &lt;p>Beim Besuch dieser Website kann Ihr Surf-Verhalten statistisch ausgewertet werden. Das geschieht vor
                allem
                mit
                sogenannten Analyseprogrammen.&lt;/p>
            &lt;p>Detaillierte Informationen zu diesen Analyseprogrammen finden Sie in der folgenden
                Datenschutzerkl&amp;auml;rung.
            &lt;/p>
            &lt;h2>2. Allgemeine Hinweise und Pflicht&amp;shy;informationen&lt;/h2>
            &lt;h3>Datenschutz&lt;/h3>
            &lt;p>Die Betreiber dieser Seiten nehmen den Schutz Ihrer pers&amp;ouml;nlichen Daten sehr ernst. Wir behandeln
                Ihre
                personenbezogenen Daten vertraulich und entsprechend den gesetzlichen Datenschutzvorschriften sowie
                dieser
                Datenschutzerkl&amp;auml;rung.&lt;/p>
            &lt;p>Wenn Sie diese Website benutzen, werden verschiedene personenbezogene Daten erhoben. Personenbezogene
                Daten
                sind
                Daten, mit denen Sie pers&amp;ouml;nlich identifiziert werden k&amp;ouml;nnen. Die vorliegende
                Datenschutzerkl&amp;auml;rung
                erl&amp;auml;utert, welche Daten wir erheben und wof&amp;uuml;r wir sie nutzen. Sie erl&amp;auml;utert auch, wie
                und zu
                welchem
                Zweck das geschieht.&lt;/p>
            &lt;p>Wir weisen darauf hin, dass die Daten&amp;uuml;bertragung im Internet (z.&amp;nbsp;B. bei der Kommunikation
                per
                E-Mail)
                Sicherheitsl&amp;uuml;cken aufweisen kann. Ein l&amp;uuml;ckenloser Schutz der Daten vor dem Zugriff durch
                Dritte
                ist
                nicht
                m&amp;ouml;glich.&lt;/p>
            &lt;h3>Hinweis zur verantwortlichen Stelle&lt;/h3>
            &lt;p>Die verantwortliche Stelle f&amp;uuml;r die Datenverarbeitung auf dieser Website ist:&lt;/p>
            &lt;p>&amp;#91;Voller Namen bzw. die vollst&amp;auml;ndige Unternehmensbezeichnung des Website-Betreibers sowie die
                vollst&amp;auml;ndige Anschrift&amp;#93;&lt;/p>
            &lt;p>Telefon: 0160-97596360&lt;br />
                E-Mail: mech.Peters@mail.de&lt;/p>
            &lt;p>Verantwortliche Stelle ist die nat&amp;uuml;rliche oder juristische Person, die allein oder gemeinsam mit
                anderen
                &amp;uuml;ber die Zwecke und Mittel der Verarbeitung von personenbezogenen Daten (z.&amp;nbsp;B. Namen,
                E-Mail-Adressen
                o.
                &amp;Auml;.) entscheidet.&lt;/p>

            &lt;h3>Speicherdauer&lt;/h3>
            &lt;p>Soweit innerhalb dieser Datenschutzerkl&amp;auml;rung keine speziellere Speicherdauer genannt wurde,
                verbleiben
                Ihre
                personenbezogenen Daten bei uns, bis der Zweck f&amp;uuml;r die Datenverarbeitung entf&amp;auml;llt. Wenn
                Sie ein
                berechtigtes L&amp;ouml;schersuchen geltend machen oder eine Einwilligung zur Datenverarbeitung
                widerrufen,
                werden
                Ihre
                Daten gel&amp;ouml;scht, sofern wir keine anderen rechtlich zul&amp;auml;ssigen Gr&amp;uuml;nde f&amp;uuml;r die
                Speicherung
                Ihrer
                personenbezogenen Daten haben (z.&amp;nbsp;B. steuer- oder handelsrechtliche Aufbewahrungsfristen); im
                letztgenannten
                Fall erfolgt die L&amp;ouml;schung nach Fortfall dieser Gr&amp;uuml;nde.&lt;/p>
            &lt;h3>Allgemeine Hinweise zu den Rechtsgrundlagen der Datenverarbeitung auf dieser Website&lt;/h3>
            &lt;p>Sofern Sie in die Datenverarbeitung eingewilligt haben, verarbeiten wir Ihre personenbezogenen Daten
                auf
                Grundlage
                von Art. 6 Abs. 1 lit. a DSGVO bzw. Art. 9 Abs. 2 lit. a DSGVO, sofern besondere Datenkategorien
                nach Art. 9
                Abs. 1
                DSGVO verarbeitet werden. Im Falle einer ausdr&amp;uuml;cklichen Einwilligung in die &amp;Uuml;bertragung
                personenbezogener
                Daten in Drittstaaten erfolgt die Datenverarbeitung au&amp;szlig;erdem auf Grundlage von Art. 49 Abs. 1
                lit. a
                DSGVO.
                Sofern Sie in die Speicherung von Cookies oder in den Zugriff auf Informationen in Ihr Endger&amp;auml;t
                (z.&amp;nbsp;B.
                via
                Device-Fingerprinting) eingewilligt haben, erfolgt die Datenverarbeitung zus&amp;auml;tzlich auf
                Grundlage von
                &amp;sect; 25
                Abs. 1 TTDSG. Die Einwilligung ist jederzeit widerrufbar. Sind Ihre Daten zur Vertragserf&amp;uuml;llung
                oder
                zur
                Durchf&amp;uuml;hrung vorvertraglicher Ma&amp;szlig;nahmen erforderlich, verarbeiten wir Ihre Daten auf
                Grundlage
                des
                Art. 6
                Abs. 1 lit. b DSGVO. Des Weiteren verarbeiten wir Ihre Daten, sofern diese zur Erf&amp;uuml;llung einer
                rechtlichen
                Verpflichtung erforderlich sind auf Grundlage von Art. 6 Abs. 1 lit. c DSGVO. Die Datenverarbeitung
                kann
                ferner
                auf
                Grundlage unseres berechtigten Interesses nach Art. 6 Abs. 1 lit. f DSGVO erfolgen. &amp;Uuml;ber die
                jeweils im
                Einzelfall einschl&amp;auml;gigen Rechtsgrundlagen wird in den folgenden Abs&amp;auml;tzen dieser
                Datenschutzerkl&amp;auml;rung
                informiert.&lt;/p>
            &lt;h3>Empfänger von personenbezogenen Daten&lt;/h3>
            &lt;p>Im Rahmen unserer Gesch&amp;auml;ftst&amp;auml;tigkeit arbeiten wir mit verschiedenen externen Stellen
                zusammen.
                Dabei
                ist
                teilweise auch eine &amp;Uuml;bermittlung von personenbezogenen Daten an diese externen Stellen
                erforderlich.
                Wir
                geben
                personenbezogene Daten nur dann an externe Stellen weiter, wenn dies im Rahmen einer
                Vertragserf&amp;uuml;llung
                erforderlich ist, wenn wir gesetzlich hierzu verpflichtet sind (z.&amp;nbsp;B. Weitergabe von Daten an
                Steuerbeh&amp;ouml;rden), wenn wir ein berechtigtes Interesse nach Art. 6 Abs. 1 lit. f DSGVO an der
                Weitergabe
                haben
                oder wenn eine sonstige Rechtsgrundlage die Datenweitergabe erlaubt. Beim Einsatz von
                Auftragsverarbeitern
                geben
                wir
                personenbezogene Daten unserer Kunden nur auf Grundlage eines g&amp;uuml;ltigen Vertrags &amp;uuml;ber
                Auftragsverarbeitung
                weiter. Im Falle einer gemeinsamen Verarbeitung wird ein Vertrag &amp;uuml;ber gemeinsame Verarbeitung
                geschlossen.
            &lt;/p>
            &lt;h3>Widerruf Ihrer Einwilligung zur Datenverarbeitung&lt;/h3>
            &lt;p>Viele Datenverarbeitungsvorg&amp;auml;nge sind nur mit Ihrer ausdr&amp;uuml;cklichen Einwilligung
                m&amp;ouml;glich. Sie
                k&amp;ouml;nnen eine bereits erteilte Einwilligung jederzeit widerrufen. Die Rechtm&amp;auml;&amp;szlig;igkeit
                der bis
                zum
                Widerruf erfolgten Datenverarbeitung bleibt vom Widerruf unber&amp;uuml;hrt.&lt;/p>
            &lt;h3>Widerspruchsrecht gegen die Datenerhebung in besonderen F&amp;auml;llen sowie gegen Direktwerbung (Art.
                21
                DSGVO)
            &lt;/h3>
            &lt;p>WENN DIE DATENVERARBEITUNG AUF GRUNDLAGE VON ART. 6 ABS. 1 LIT. E ODER F DSGVO ERFOLGT, HABEN SIE
                JEDERZEIT
                DAS
                RECHT, AUS GR&amp;Uuml;NDEN, DIE SICH AUS IHRER BESONDEREN SITUATION ERGEBEN, GEGEN DIE VERARBEITUNG
                IHRER
                PERSONENBEZOGENEN DATEN WIDERSPRUCH EINZULEGEN; DIES GILT AUCH F&amp;Uuml;R EIN AUF DIESE BESTIMMUNGEN
                GEST&amp;Uuml;TZTES
                PROFILING. DIE JEWEILIGE RECHTSGRUNDLAGE, AUF DENEN EINE VERARBEITUNG BERUHT, ENTNEHMEN SIE DIESER
                DATENSCHUTZERKL&amp;Auml;RUNG. WENN SIE WIDERSPRUCH EINLEGEN, WERDEN WIR IHRE BETROFFENEN
                PERSONENBEZOGENEN
                DATEN
                NICHT
                MEHR VERARBEITEN, ES SEI DENN, WIR K&amp;Ouml;NNEN ZWINGENDE SCHUTZW&amp;Uuml;RDIGE GR&amp;Uuml;NDE F&amp;Uuml;R DIE
                VERARBEITUNG
                NACHWEISEN, DIE IHRE INTERESSEN, RECHTE UND FREIHEITEN &amp;Uuml;BERWIEGEN ODER DIE VERARBEITUNG DIENT
                DER
                GELTENDMACHUNG, AUS&amp;Uuml;BUNG ODER VERTEIDIGUNG VON RECHTSANSPR&amp;Uuml;CHEN (WIDERSPRUCH NACH ART. 21
                ABS. 1
                DSGVO).
            &lt;/p>
            &lt;p>WERDEN IHRE PERSONENBEZOGENEN DATEN VERARBEITET, UM DIREKTWERBUNG ZU BETREIBEN, SO HABEN SIE DAS
                RECHT,
                JEDERZEIT
                WIDERSPRUCH GEGEN DIE VERARBEITUNG SIE BETREFFENDER PERSONENBEZOGENER DATEN ZUM ZWECKE DERARTIGER
                WERBUNG
                EINZULEGEN; DIES GILT AUCH F&amp;Uuml;R DAS PROFILING, SOWEIT ES MIT SOLCHER DIREKTWERBUNG IN VERBINDUNG
                STEHT.
                WENN
                SIE
                WIDERSPRECHEN, WERDEN IHRE PERSONENBEZOGENEN DATEN ANSCHLIESSEND NICHT MEHR ZUM ZWECKE DER
                DIREKTWERBUNG
                VERWENDET
                (WIDERSPRUCH NACH ART. 21 ABS. 2 DSGVO).&lt;/p>
            &lt;h3>Beschwerde&amp;shy;recht bei der zust&amp;auml;ndigen Aufsichts&amp;shy;beh&amp;ouml;rde&lt;/h3>
            &lt;p>Im Falle von Verst&amp;ouml;&amp;szlig;en gegen die DSGVO steht den Betroffenen ein Beschwerderecht bei einer
                Aufsichtsbeh&amp;ouml;rde, insbesondere in dem Mitgliedstaat ihres gew&amp;ouml;hnlichen Aufenthalts, ihres
                Arbeitsplatzes
                oder des Orts des mutma&amp;szlig;lichen Versto&amp;szlig;es zu. Das Beschwerderecht besteht unbeschadet
                anderweitiger
                verwaltungsrechtlicher oder gerichtlicher Rechtsbehelfe.&lt;/p>
            &lt;h3>Recht auf Daten&amp;shy;&amp;uuml;bertrag&amp;shy;barkeit&lt;/h3>
            &lt;p>Sie haben das Recht, Daten, die wir auf Grundlage Ihrer Einwilligung oder in Erf&amp;uuml;llung eines
                Vertrags
                automatisiert verarbeiten, an sich oder an einen Dritten in einem g&amp;auml;ngigen, maschinenlesbaren
                Format
                aush&amp;auml;ndigen zu lassen. Sofern Sie die direkte &amp;Uuml;bertragung der Daten an einen anderen
                Verantwortlichen
                verlangen, erfolgt dies nur, soweit es technisch machbar ist.&lt;/p>
            &lt;h3>Auskunft, Berichtigung und L&amp;ouml;schung&lt;/h3>
            &lt;p>Sie haben im Rahmen der geltenden gesetzlichen Bestimmungen jederzeit das Recht auf unentgeltliche
                Auskunft
                &amp;uuml;ber
                Ihre gespeicherten personenbezogenen Daten, deren Herkunft und Empf&amp;auml;nger und den Zweck der
                Datenverarbeitung
                und ggf. ein Recht auf Berichtigung oder L&amp;ouml;schung dieser Daten. Hierzu sowie zu weiteren Fragen
                zum
                Thema
                personenbezogene Daten k&amp;ouml;nnen Sie sich jederzeit an uns wenden.&lt;/p>
            &lt;h3>Recht auf Einschr&amp;auml;nkung der Verarbeitung&lt;/h3>
            &lt;p>Sie haben das Recht, die Einschr&amp;auml;nkung der Verarbeitung Ihrer personenbezogenen Daten zu
                verlangen.
                Hierzu
                k&amp;ouml;nnen Sie sich jederzeit an uns wenden. Das Recht auf Einschr&amp;auml;nkung der Verarbeitung
                besteht in
                folgenden
                F&amp;auml;llen:&lt;/p>
            &lt;ul>
                &lt;li>Wenn Sie die Richtigkeit Ihrer bei uns gespeicherten personenbezogenen Daten bestreiten,
                    ben&amp;ouml;tigen
                    wir
                    in
                    der Regel Zeit, um dies zu &amp;uuml;berpr&amp;uuml;fen. F&amp;uuml;r die Dauer der Pr&amp;uuml;fung haben Sie
                    das
                    Recht,
                    die
                    Einschr&amp;auml;nkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen.&lt;/li>
                &lt;li>Wenn die Verarbeitung Ihrer personenbezogenen Daten unrechtm&amp;auml;&amp;szlig;ig geschah/geschieht,
                    k&amp;ouml;nnen
                    Sie
                    statt der L&amp;ouml;schung die Einschr&amp;auml;nkung der Datenverarbeitung verlangen.&lt;/li>
                &lt;li>Wenn wir Ihre personenbezogenen Daten nicht mehr ben&amp;ouml;tigen, Sie sie jedoch zur
                    Aus&amp;uuml;bung,
                    Verteidigung
                    oder Geltendmachung von Rechtsanspr&amp;uuml;chen ben&amp;ouml;tigen, haben Sie das Recht, statt der
                    L&amp;ouml;schung
                    die
                    Einschr&amp;auml;nkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen.&lt;/li>
                &lt;li>Wenn Sie einen Widerspruch nach Art. 21 Abs. 1 DSGVO eingelegt haben, muss eine Abw&amp;auml;gung
                    zwischen
                    Ihren
                    und
                    unseren Interessen vorgenommen werden. Solange noch nicht feststeht, wessen Interessen
                    &amp;uuml;berwiegen,
                    haben
                    Sie das Recht, die Einschr&amp;auml;nkung der Verarbeitung Ihrer personenbezogenen Daten zu
                    verlangen.&lt;/li>
            &lt;/ul>
            &lt;p>Wenn Sie die Verarbeitung Ihrer personenbezogenen Daten eingeschr&amp;auml;nkt haben, d&amp;uuml;rfen diese
                Daten
                &amp;ndash;
                von
                ihrer Speicherung abgesehen &amp;ndash; nur mit Ihrer Einwilligung oder zur Geltendmachung,
                Aus&amp;uuml;bung oder
                Verteidigung von Rechtsanspr&amp;uuml;chen oder zum Schutz der Rechte einer anderen nat&amp;uuml;rlichen
                oder
                juristischen
                Person oder aus Gr&amp;uuml;nden eines wichtigen &amp;ouml;ffentlichen Interesses der Europ&amp;auml;ischen
                Union oder
                eines
                Mitgliedstaats verarbeitet werden.&lt;/p>
            &lt;h3>Widerspruch gegen Werbe-E-Mails&lt;/h3>
            &lt;p>Der Nutzung von im Rahmen der Impressumspflicht ver&amp;ouml;ffentlichten Kontaktdaten zur
                &amp;Uuml;bersendung von
                nicht
                ausdr&amp;uuml;cklich angeforderter Werbung und Informationsmaterialien wird hiermit widersprochen. Die
                Betreiber
                der
                Seiten behalten sich ausdr&amp;uuml;cklich rechtliche Schritte im Falle der unverlangten Zusendung von
                Werbeinformationen, etwa durch Spam-E-Mails, vor.&lt;/p>
            &lt;p>Quelle: &lt;a href="https://www.e-recht24.de">https://www.e-recht24.de&lt;/a>&lt;/p>
        &lt;/section>`;
    return html;
}
</code></pre>
        </article>
    </section>




</div>

<nav>
    <h2><a href="index.html">Home</a></h2><h3>Classes</h3><ul><li><a href="BackgroundObject.html">BackgroundObject</a></li><li><a href="Bottle.html">Bottle</a></li><li><a href="Character.html">Character</a></li><li><a href="Chicken.html">Chicken</a></li><li><a href="Cloud.html">Cloud</a></li><li><a href="Coin.html">Coin</a></li><li><a href="DrawableObject.html">DrawableObject</a></li><li><a href="Endboss.html">Endboss</a></li><li><a href="Keyboard.html">Keyboard</a></li><li><a href="Level.html">Level</a></li><li><a href="MovableObject.html">MovableObject</a></li><li><a href="NormalChicken.html">NormalChicken</a></li><li><a href="SmallChicken.html">SmallChicken</a></li><li><a href="StatusBarBottles.html">StatusBarBottles</a></li><li><a href="StatusBarCoins.html">StatusBarCoins</a></li><li><a href="StatusBarEndboss.html">StatusBarEndboss</a></li><li><a href="StatusBarHealth.html">StatusBarHealth</a></li><li><a href="ThrowableObject.html">ThrowableObject</a></li><li><a href="World.html">World</a></li></ul><h3>Global</h3><ul><li><a href="global.html#addListenersToButtons">addListenersToButtons</a></li><li><a href="global.html#addTouchListeners">addTouchListeners</a></li><li><a href="global.html#changeView">changeView</a></li><li><a href="global.html#clearAllIntervals">clearAllIntervals</a></li><li><a href="global.html#delay">delay</a></li><li><a href="global.html#dontClose">dontClose</a></li><li><a href="global.html#genLegal">genLegal</a></li><li><a href="global.html#genPrivacy">genPrivacy</a></li><li><a href="global.html#handleFullscreenChange">handleFullscreenChange</a></li><li><a href="global.html#handleKey">handleKey</a></li><li><a href="global.html#hideElement">hideElement</a></li><li><a href="global.html#hideMenu">hideMenu</a></li><li><a href="global.html#init">init</a></li><li><a href="global.html#initLevel">initLevel</a></li><li><a href="global.html#leaveFullscreen">leaveFullscreen</a></li><li><a href="global.html#playMusic">playMusic</a></li><li><a href="global.html#playSound">playSound</a></li><li><a href="global.html#restartGame">restartGame</a></li><li><a href="global.html#setFullscreen">setFullscreen</a></li><li><a href="global.html#showElement">showElement</a></li><li><a href="global.html#showLegal">showLegal</a></li><li><a href="global.html#showPrivacy">showPrivacy</a></li><li><a href="global.html#startGame">startGame</a></li><li><a href="global.html#stopGame">stopGame</a></li><li><a href="global.html#toggleMute">toggleMute</a></li></ul>
</nav>

<br class="clear">

<footer>
    Documentation generated by <a href="https://github.com/jsdoc/jsdoc">JSDoc 4.0.2</a> on Wed May 29 2024 22:31:02 GMT+0200 (Mitteleuropäische Sommerzeit)
</footer>

<script> prettyPrint(); </script>
<script src="scripts/linenumber.js"> </script>
</body>
</html>
